Autodesk.Revit.DB.PhaseFilter.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new phase filter with default status presentation.
Remarks:
The default status presentation is ShowByCategory for New status, and ShowOverriden for Existing,
Demolished and Temporary statuses.
document:
The document.
name:
The name.
Returns:
The newly created phase filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is already in use.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013